{
  "source_file": "dark_ritual.pdf",
  "analysis_model": "claude",
  "analysis_version": "v3_strict_thresholds",
  "metadata": {
    "filename": "dark_ritual.pdf",
    "page_count": 99,
    "word_count": 18088
  },
  "analysis": {
    "title": "Dark Ritual",
    "author": "Kevin Kneupper",
    "logline": "When cultists unleash otherworldly monsters on a small town, a troubled cop and a runaway teen must stop the ritual that opened a portal to another dimension before everyone within a hundred miles is consumed.",
    "genre": "Horror",
    "subgenres": [
      "Monster",
      "Occult",
      "Small Town Horror"
    ],
    "themes": [
      "Sacrifice",
      "Redemption",
      "Facing one's demons",
      "Parenthood",
      "Abuse"
    ],
    "tone": "Gritty, suspenseful, visceral",
    "dimension_scores": {
      "concept": {
        "score": 7,
        "justification": "The concept of cultists opening a portal to another dimension, unleashing monsters on a small town, is compelling and easily marketable. The unique mechanic of sacrifices needed to close the portal creates immediate stakes. However, it's not entirely fresh territory in the horror genre."
      },
      "structure": {
        "score": 6,
        "justification": "The script follows a fairly standard horror structure, moving from initial incident to escalating threats. The pacing is generally effective, with good tension building, but the middle section in the police station becomes somewhat repetitive with similar monster encounters."
      },
      "protagonist": {
        "score": 6,
        "justification": "Miles has a clear internal struggle with alcoholism and guilt over abandoning his family that ties into his redemptive arc. However, he remains somewhat reactive until the final act, and his transformation could be more fully earned through earlier actions."
      },
      "supporting_cast": {
        "score": 7,
        "justification": "The script features a distinctive ensemble of small-town characters. Sophie, Dale, Vanessa, and Old Man Greely all have clear personalities and motivations. The transformation of Greely into a monster while retaining his consciousness is particularly effective."
      },
      "dialogue": {
        "score": 8,
        "justification": "Dialogue is a strength, with distinct voices for each character. The southern/rural cadence feels authentic, and characters reveal themselves through speech patterns. Dale's aggressive colloquialisms contrast well with Miles's more reflective tone."
      },
      "genre_execution": {
        "score": 7,
        "justification": "The script delivers on horror conventions with effective monster designs, graphic violence, and building tension. The Tar Men and Old Man Greely's transformation are viscerally frightening. It hits the expected notes while adding interesting elements like the knife ritual mechanic."
      },
      "originality": {
        "score": 6,
        "justification": "While the script combines familiar elements in competent ways, it doesn't reinvent the genre. The small-town setting, otherworldly monsters, and cultists are recognizable tropes. The ritual knife concept and the Greely-Thing are the most distinctive original elements."
      },
      "weighted_score": 6.7
    },
    "critical_failures": [],
    "major_weaknesses": [
      "Middle section becomes somewhat repetitive with similar monster encounters",
      "Protagonist remains reactive for too long"
    ],
    "commercial_viability": {
      "target_audience": {
        "score": 3,
        "note": "Clear appeal to horror fans who frequent theatrical releases"
      },
      "high_concept": {
        "score": 2,
        "note": "Easily explained but not uniquely distinctive"
      },
      "cast_attachability": {
        "score": 2,
        "note": "Miles and Sophie offer solid character roles"
      },
      "marketing_hook": {
        "score": 3,
        "note": "Monster designs and visceral horror elements provide clear marketing imagery"
      },
      "budget_return_ratio": {
        "score": 3,
        "note": "Horror typically offers strong ROI at modest budgets"
      },
      "comparable_success": {
        "score": 2,
        "note": "Similar horror films have performed well, but market can be saturated"
      },
      "cvs_total": "15"
    },
    "structure_analysis": {
      "format_quality": "professional",
      "act_breaks": "Act 1: Sophie escapes the ritual; Act 2: Miles and others barricade in police station; Act 3: Final confrontation with the Greely-Thing and Miles's sacrifice",
      "pacing": "medium to fast, with effective tension building but some repetitive elements in the second act"
    },
    "characters": {
      "protagonist": "Miles, a troubled alcoholic cop seeking redemption for abandoning his family, with a clear goal to protect Sophie and survive",
      "antagonist": "The otherworldly monsters and cultists, with Dale becoming a secondary human antagonist",
      "supporting": [
        "Sophie - runaway teen with abusive past, resourceful and determined",
        "Dale - aggressive, impulsive cop willing to sacrifice others",
        "Vanessa - single mother prostitute with clear motivation",
        "Old Man Greely - town drunk who transforms into a horrific monster"
      ]
    },
    "standout_scenes": [
      {
        "scene": "Old Man Greely's transformation into the Greely-Thing",
        "why": "Viscerally horrifying with strong body horror elements and psychological terror as he remains conscious"
      },
      {
        "scene": "The initial ritual scene with Sophie's escape",
        "why": "Sets up the stakes and supernatural threat effectively while establishing Sophie's resourcefulness"
      },
      {
        "scene": "Miles's final sacrifice with the knife to save Sophie",
        "why": "Emotional payoff for his character arc, showing growth through self-sacrifice"
      }
    ],
    "comparable_films": [
      {
        "title": "The Void",
        "similarity": "Similar small-town setting with interdimensional monsters and cultists",
        "box_office_relevance": "Cult success with modest box office"
      },
      {
        "title": "From Dusk Till Dawn",
        "similarity": "Characters trapped in a location fighting monsters with survival horror elements",
        "box_office_relevance": "Successful with strong cult following"
      },
      {
        "title": "The Mist",
        "similarity": "Small town besieged by monsters with human conflicts amid the horror",
        "box_office_relevance": "Mixed box office but strong critical reception"
      }
    ],
    "target_audience": {
      "primary_demographic": "18-34 horror enthusiasts",
      "gender_skew": "neutral",
      "interests": [
        "body horror",
        "creature features",
        "supernatural horror",
        "gritty action"
      ]
    },
    "budget_tier": {
      "category": "low ($1-10M)",
      "justification": "Horror special effects required for monsters and gore, but limited locations and cast size keep costs manageable"
    },
    "assessment": {
      "strengths": [
        "Distinct, colorful dialogue that establishes setting and characters",
        "Viscerally effective monster designs with the Tar Men and Greely-Thing",
        "Strong parallel between Miles's personal demons and the literal monsters",
        "Clear stakes and escalating tension throughout"
      ],
      "weaknesses": [
        "Protagonist remains somewhat passive until the final act",
        "Middle section becomes repetitive with similar monster encounters",
        "Some character decisions seem motivated by plot requirements rather than established traits",
        "Exposition about the ritual and its rules feels clunky at times"
      ],
      "development_notes": [
        "Give Miles more agency earlier in the story to strengthen his arc",
        "Vary the monster encounters in the middle section to avoid repetition",
        "Develop a more unique angle on the cultist/dimensional monster premise to increase originality",
        "Strengthen the thematic connection between Miles's alcoholism and the monsters"
      ],
      "marketability": "medium-high - The script has clear appeal to horror audiences with its visceral monsters, small-town setting, and contained story. The budget-to-return ratio for horror remains favorable, and the monster designs offer strong marketing imagery.",
      "recommendation": "CONSIDER",
      "recommendation_rationale": "With a weighted score of 6.7, strong dialogue and effective genre execution, this screenplay demonstrates commercial potential but requires development. No critical failures are present, the CVS score of 15 is strong, and the issues identified are fixable within 1-2 drafts."
    },
    "verdict_statement": "This screenplay shows genuine strength in dialogue, monster design, and visceral horror execution but requires development attention to protagonist agency and repetitive middle section elements. With a more active protagonist and varied monster encounters, this project could achieve RECOMMEND status."
  },
  "tmdb_status": {
    "is_produced": true,
    "tmdb_id": 851622,
    "tmdb_title": "Dark Ritual",
    "release_date": "2021-07-15",
    "status": "Released",
    "checked_at": "2026-02-02T00:45:37.505392",
    "confidence": "high"
  }
}