{
  "source_file": "man_wedding.pdf",
  "analysis_model": "claude",
  "analysis_version": "v3_strict_thresholds",
  "metadata": {
    "filename": "man_wedding.pdf",
    "page_count": 112,
    "word_count": 18682
  },
  "analysis": {
    "title": "Man Wedding",
    "author": "Amos Posner",
    "logline": "When a commitment-phobic lawyer reluctantly agrees to plan his own wedding, his attempt to create a non-traditional celebration spirals into an elaborate spectacle that threatens his relationship.",
    "genre": "Comedy",
    "subgenres": [
      "Romantic Comedy",
      "Wedding Comedy"
    ],
    "themes": [
      "Commitment",
      "Authenticity",
      "Compromise",
      "Control"
    ],
    "tone": "Humorous with genuine emotional undercurrents",
    "dimension_scores": {
      "concept": {
        "score": 8,
        "justification": "A role-reversed wedding comedy where the groom plans the wedding is immediately intriguing and sellable. The 'Man Wedding' concept speaks to modern relationship dynamics while keeping the familiar wedding comedy framework that audiences recognize."
      },
      "structure": {
        "score": 7,
        "justification": "Clear three-act structure with a well-defined catalyst (agreeing to plan the wedding), escalating complications (increasingly absurd wedding plans), and satisfying resolution (Vegas elopement). Some minor pacing issues in the second act when we lose sight of Aggie's perspective."
      },
      "protagonist": {
        "score": 7,
        "justification": "Tom has clear wants (to avoid a traditional wedding) and needs (to commit meaningfully to Aggie). His reluctance feels genuine, his journey is active, and his ultimate realization that he'd rather marry Aggie simply than plan an elaborate event demonstrates meaningful growth."
      },
      "supporting_cast": {
        "score": 8,
        "justification": "The supporting characters are distinct and memorable. Ben's enthusiasm contrasts Tom's reluctance; Jamie provides pragmatic perspective; each poker buddy has unique traits; even minor characters like Uncle Al and Richard have memorable voices and characteristics."
      },
      "dialogue": {
        "score": 8,
        "justification": "Sharp, witty dialogue throughout. Characters have distinct voices - Tom's dry pessimism, Aggie's artistic sensibility, Ben's puppy-like enthusiasm, and Jamie's pragmatism all come through consistently in their dialogue patterns. The banter feels natural, and exposition is handled well."
      },
      "genre_execution": {
        "score": 7,
        "justification": "Delivers on the romantic comedy promises with the right balance of humor and heart. Effectively subverts wedding comedy tropes while still providing the expected pleasures of the genre. Some of the wedding mishaps feel familiar, but the male planning perspective refreshes them."
      },
      "originality": {
        "score": 7,
        "justification": "While working within the familiar wedding comedy template, the script offers a fresh take by inverting gender expectations and focusing on the groom's perspective. The 'man wedding' concept and the poker buddies' involvement provide distinctive elements not commonly seen in the genre."
      },
      "weighted_score": 7.45
    },
    "critical_failures": [],
    "major_weaknesses": [
      "Aggie's character could be more developed in the second act as Tom's planning consumes the narrative"
    ],
    "commercial_viability": {
      "target_audience": {
        "score": 3,
        "note": "Clear appeal to 25-45 demographic who consume wedding comedies"
      },
      "high_concept": {
        "score": 3,
        "note": "'Groom plans outrageous wedding' is immediately graspable"
      },
      "cast_attachability": {
        "score": 3,
        "note": "Multiple strong roles for comedy actors in their 30s"
      },
      "marketing_hook": {
        "score": 2,
        "note": "Visual gags and wedding chaos provide trailer moments"
      },
      "budget_return_ratio": {
        "score": 3,
        "note": "Mid-budget comedy with strong ROI potential"
      },
      "comparable_success": {
        "score": 2,
        "note": "Wedding comedies have consistent but not blockbuster performance"
      },
      "cvs_total": "16"
    },
    "structure_analysis": {
      "format_quality": "professional",
      "act_breaks": "Act 1 break: Tom agrees to plan wedding (p.27); Act 2 break: Aggie walks out of the disastrous wedding (p.87)",
      "pacing": "medium with some second act bloat during the wedding planning committee scenes"
    },
    "characters": {
      "protagonist": "Tom Neyer, a risk-averse lawyer who wants to marry Aggie but abhors traditional weddings; clear goal to create a non-traditional wedding",
      "antagonist": "Situational - the wedding industrial complex and social expectations, embodied by characters like Yovani",
      "supporting": [
        "Aggie Willet - Tom's fiancée, an artist who gives him control to avoid wedding stress",
        "Ben Neyer - Tom's enthusiastic younger brother who pushes him toward extravagance",
        "Jamie - Ben's pragmatic wife who offers Aggie grounded advice",
        "Bill, Ramjit, Sean, Mark, Chet - Tom's poker buddies who each take on wedding responsibilities",
        "Richard - Aggie's intimidating father who funds the wedding",
        "Alice - Tom's overbearing mother"
      ]
    },
    "standout_scenes": [
      {
        "scene": "Tom's breakfast-food proposal",
        "why": "Charmingly awkward and genuine character moment"
      },
      {
        "scene": "Jamie burning her wedding dress by the river",
        "why": "Unexpected character depth and humor"
      },
      {
        "scene": "The chaotic Beervana wedding with celebrities and mascots",
        "why": "Effective comedic payoff to the escalating wedding plans"
      },
      {
        "scene": "Vegas elopement with Tom and Aggie giggling at their formal names",
        "why": "Authentic emotional payoff that underscores the theme"
      }
    ],
    "comparable_films": [
      {
        "title": "Bridesmaids",
        "similarity": "Wedding comedy with adult humor but from female perspective",
        "box_office_relevance": "success"
      },
      {
        "title": "The Hangover",
        "similarity": "Male-centered comedy about wedding adjacent events",
        "box_office_relevance": "success"
      },
      {
        "title": "I Love You, Man",
        "similarity": "Male friendship comedy in wedding context",
        "box_office_relevance": "success"
      }
    ],
    "target_audience": {
      "primary_demographic": "25-45, urban and suburban professionals",
      "gender_skew": "neutral",
      "interests": [
        "romantic comedies",
        "wedding content",
        "adult humor",
        "relationship dynamics"
      ]
    },
    "budget_tier": {
      "category": "low ($1-10M)",
      "justification": "Comedy requiring minimal VFX, primarily interior locations with limited set pieces, with room for mid-level comedy actors"
    },
    "assessment": {
      "strengths": [
        "Fresh perspective on the wedding comedy genre through male planning lens",
        "Strong ensemble of distinctive characters with memorable traits",
        "Witty dialogue that effectively balances humor and emotional moments",
        "Clear character arcs for both Tom and Aggie with satisfying emotional resolution"
      ],
      "weaknesses": [
        "Aggie's perspective gets somewhat lost during the second act",
        "Some wedding planning committee scenes feel repetitive",
        "The Beervana partnership subplot could be more efficiently integrated",
        "Some peripheral characters (Laura, Lucy, Erin) lack distinction"
      ],
      "development_notes": [
        "Strengthen Aggie's arc by including more scenes from her perspective during the second act",
        "Trim redundant planning committee scenes to tighten pacing",
        "Clarify Tom's relationship with his parents earlier to better set up their wedding appearances",
        "Introduce the idea of corporate sponsorship earlier to make the Beervana twist feel more integrated"
      ],
      "marketability": "high - accessible concept with broad appeal to comedy audiences and specific appeal to the wedding-interested demographic",
      "recommendation": "CONSIDER",
      "recommendation_rationale": "With a weighted score of 7.45, no critical failures, and a strong CVS of 16, this screenplay shows substantial promise. While it falls just short of the RECOMMEND threshold of 7.5, its commercial viability and strong character work make it worthy of serious consideration with targeted development."
    },
    "verdict_statement": "This screenplay shows genuine warmth, humor, and a refreshing take on the wedding comedy genre but requires development attention to strengthen Aggie's perspective and streamline the second act. With these specific adjustments to balance the narrative and tighten pacing, this project could achieve RECOMMEND status."
  },
  "tmdb_status": {
    "is_produced": false,
    "tmdb_id": null,
    "tmdb_title": null,
    "release_date": null,
    "status": null,
    "checked_at": "2026-02-02T00:45:51.235708",
    "confidence": "medium"
  }
}